---
type: Sketch
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# Sketch

`Autodesk.Revit.DB.Sketch` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllElements | 2022 | `public IList < ElementId > GetAllElements ()` |
| Property | OwnerId | 2022 | `public ElementId OwnerId { get ; }` |
| Property | Parameter | — | `` |
| Property | Profile | — | `public CurveArrArray Profile { get ; }` |
| Property | SketchPlane | — | `public SketchPlane SketchPlane { get ; }` |